// Напишите прогамму, которая экспериментально определяет максимальное и
// минимальное значения, которые можно записать в переменную типа int.
#include <iostream>

int main() {
    unsigned long int b=-1;
    std::cout<< b;
    long int a;
    std::cout<< a;


}

